Enterprise_Serivces/Prod/Bronze4/TradeValueService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><CorrelationID xmlns="http://www.gamestop.com/CSL/Marketing/TradeValue/V2.0">3fb4b06e-60c6-4e18-bb85-8411871743f3</CorrelationID><MachineName xmlns="http://www.gamestop.com/CSL/Marketing/TradeValue/V2.0">test</MachineName><wsa:Action>http://www.gamestop.com/CSL/Marketing/TradeValue/V2.0/TradeValueService/GetRecordsBySKUs</wsa:Action><wsa:MessageID>uuid:41ae00e9-e067-438d-ae76-d053b0933470</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://csltradevalueserviceprod.gha.pvt/TradeValueService.svc</wsa:To></soap:Header><soap:Body><GetRecordsBySKUsRequest xmlns="http://www.gamestop.com/CSL/Marketing/TradeValue/V2.0"><Concept>store</Concept><SKUs><string xmlns="http://schemas.microsoft.com/2003/10/Serialization/Arrays">952123</string></SKUs></GetRecordsBySKUsRequest></soap:Body></soap:Envelope>